const { dataFilter } = require('../data-filter')

const data = [
  [ 'building', 'normalizedBuilding', 'address' ],
  [ 'ライオンズマンション浦和元町', 'ﾗｲｵﾝｽﾞﾏﾝｼｮﾝ浦和元町', '埼玉県さいたま市浦和区元町一丁目33-15' ],
  [ 'パークスクエア浦和常盤', 'ﾊﾟ-ｸｽｸｴｱ浦和常盤', '埼玉県さいたま市浦和区常盤一丁目49-1' ],
  [ 'パークスクエア浦和常磐', 'ﾊﾟ-ｸｽｸｴｱ浦和常磐', '埼玉県さいたま市浦和区常盤一丁目49-1' ],
  [ 'ファイン　ブルーム', 'ﾌｧｲﾝﾌﾞﾙ-ﾑ', '神奈川県茅ヶ崎市本宿町1-30' ],
  [ 'ファイン ブルーム', 'ﾌｧｲﾝﾌﾞﾙ-ﾑ', '神奈川県茅ヶ崎市本宿町1-30' ],
  [ 'ファイン ブルームⅵ', 'ﾌｧｲﾝﾌﾞﾙ-ﾑⅵ', '神奈川県茅ヶ崎市本宿町1-30' ],
  [ 'ファイン ブルームⅥ', 'ﾌｧｲﾝﾌﾞﾙ-ﾑⅥ', '神奈川県茅ヶ崎市本宿町1-30' ]
]

describe('分類テスト', () => {

  test('1つの住所に、複数の建物と1つの建物で分類', async () => {
    const {buildingCSV, multiBuildingsCSV} = await dataFilter(data)
    const singleBuilding = [ [ 'ライオンズマンション浦和元町', 'ﾗｲｵﾝｽﾞﾏﾝｼｮﾝ浦和元町', '埼玉県さいたま市浦和区元町一丁目33-15' ] ]
    const multiBuildings = [
      [ 'パークスクエア浦和常盤', 'ﾊﾟ-ｸｽｸｴｱ浦和常盤', '埼玉県さいたま市浦和区常盤一丁目49-1' ],
      [ 'パークスクエア浦和常磐', 'ﾊﾟ-ｸｽｸｴｱ浦和常磐', '埼玉県さいたま市浦和区常盤一丁目49-1' ],
      [ 'ファイン ブルーム', 'ﾌｧｲﾝﾌﾞﾙ-ﾑ', '神奈川県茅ヶ崎市本宿町1-30' ],
      [ 'ファイン ブルームⅵ', 'ﾌｧｲﾝﾌﾞﾙ-ﾑⅵ', '神奈川県茅ヶ崎市本宿町1-30' ],
      [ 'ファイン ブルームⅥ', 'ﾌｧｲﾝﾌﾞﾙ-ﾑⅥ', '神奈川県茅ヶ崎市本宿町1-30' ]
    ]
    expect(buildingCSV).toMatchObject(singleBuilding)
    expect(multiBuildingsCSV).toMatchObject(multiBuildings)
  })
})
