const { dataSplitListBuilding } = require('../data-split-serial-building')

const data = [
  [ 'building', 'normalizedBuilding', 'address' ],
  // 単なる表記揺れ
  [ 'ザ・パークサイド', 'ｻﾞﾊﾟ-ｸｻｲﾄﾞ', '神奈川県横浜市青葉区梅が丘30-4' ],
  [ 'ザ・ハークサイド', 'ｻﾞﾊ-ｸｻｲﾄﾞ', '神奈川県横浜市青葉区梅が丘30-4' ],
  // 連番 + 連番なし
  [ 'シャトー・ミニヨン', 'ｼﾔﾄ-ﾐﾆﾖﾝ', '埼玉県さいたま市浦和区元町一丁目33-15' ],
  [ 'シャトー・ミニヨン壱番館', 'ｼﾔﾄ-ﾐﾆﾖﾝ1', '埼玉県さいたま市浦和区元町一丁目33-15' ],
  [ 'シャトー・ミニヨン弐番館', 'ｼﾔﾄ-ﾐﾆﾖﾝ2', '埼玉県さいたま市浦和区元町一丁目33-15' ],
  // アルファベット
  [ 'ザ・パークハウス横浜大口', 'ｻﾞﾊﾟ-ｸﾊｳｽ横浜大口', '神奈川県横浜市神奈川区西寺尾一丁目1-1' ],
  [ 'ザ・パークハウス横浜大口B棟', 'ｻﾞﾊﾟ-ｸﾊｳｽ横浜大口b', '神奈川県横浜市神奈川区西寺尾一丁目1-1' ],
  [ 'ザ・パークハウス横浜大口C棟', 'ｻﾞﾊﾟ-ｸﾊｳｽ横浜大口c', '神奈川県横浜市神奈川区西寺尾一丁目1-1' ],
  // 数字3桁
  [ 'タワービレッジ鷺沼　304', 'ﾀﾜ-ﾋﾞﾚﾂｼﾞ鷺沼304', '神奈川県川崎市宮前区東有馬二丁目38-1' ],
  [ 'タワービレッジ鷺沼　310', 'ﾀﾜ-ﾋﾞﾚﾂｼﾞ鷺沼310', '神奈川県川崎市宮前区東有馬二丁目38-1' ],
  // ローマ数字
  [ 'ファイブアイランドⅠ', 'ﾌｱｲﾌﾞｱｲﾗﾝﾄﾞⅰ', '三重県伊勢市竹ケ鼻町160-1' ],
  [ 'ファイブアイランドⅢ', 'ﾌｱｲﾌﾞｱｲﾗﾝﾄﾞⅲ', '三重県伊勢市竹ケ鼻町160-1' ],
  [ 'ファイブアイランドⅫ', 'ﾌｱｲﾌﾞｱｲﾗﾝﾄﾞⅻ', '三重県伊勢市竹ケ鼻町160-1' ],
  //記号数字
  [ 'パイン新宿', 'ﾊﾟｲﾝ新宿', '東京都新宿区北新宿一丁目20-10' ],
  [ 'パイン新宿③❹⑸⒍', 'ﾊﾟｲﾝ新宿③❹⑸⒍', '東京都新宿区北新宿一丁目20-10' ],
  // アルファベット + 連番
  [ 'ＡＱＵＡ ＳＷＥＥＴ ＮＩＰＰＯＲＩ A号館', 'aquasweetnipporia', '東京都荒川区西日暮里一丁目27-11' ],
  [ 'ＡＱＵＡ ＳＷＥＥＴ ＮＩＰＰＯＲＩ B号館', 'aquasweetnipporib', '東京都荒川区西日暮里一丁目27-11' ],
  // 連番に仕分けられていなかったデータ
  [ 'マイスタイル町屋壱番館', 'ﾏｲｽﾀｲﾙ町屋1', '東京都荒川区荒川四丁目3-3' ],
  [ 'マイスタイル町屋弐番館', 'ﾏｲｽﾀｲﾙ町屋2', '東京都荒川区荒川四丁目3-3' ]
]

test('連番とそれ以外のビル名を分離', async () => {
  const {multiBuildingsRandom, multiBuildingsSerials} = await dataSplitListBuilding(data)

  expect(multiBuildingsRandom).toMatchObject([
    [ 'ザ・パークサイド', 'ｻﾞﾊﾟ-ｸｻｲﾄﾞ', '神奈川県横浜市青葉区梅が丘30-4' ],
    [ 'ザ・ハークサイド', 'ｻﾞﾊ-ｸｻｲﾄﾞ', '神奈川県横浜市青葉区梅が丘30-4' ],
    [ 'ＡＱＵＡ ＳＷＥＥＴ ＮＩＰＰＯＲＩ A号館', 'aquasweetnipporia', '東京都荒川区西日暮里一丁目27-11' ],
    [ 'ＡＱＵＡ ＳＷＥＥＴ ＮＩＰＰＯＲＩ B号館', 'aquasweetnipporib', '東京都荒川区西日暮里一丁目27-11' ]
  ])

  expect(multiBuildingsSerials).toMatchObject([
    [ 'シャトー・ミニヨン', 'ｼﾔﾄ-ﾐﾆﾖﾝ', '埼玉県さいたま市浦和区元町一丁目33-15' ],
    [ 'シャトー・ミニヨン壱番館', 'ｼﾔﾄ-ﾐﾆﾖﾝ1', '埼玉県さいたま市浦和区元町一丁目33-15' ],
    [ 'シャトー・ミニヨン弐番館', 'ｼﾔﾄ-ﾐﾆﾖﾝ2', '埼玉県さいたま市浦和区元町一丁目33-15' ],
    [ 'ザ・パークハウス横浜大口', 'ｻﾞﾊﾟ-ｸﾊｳｽ横浜大口', '神奈川県横浜市神奈川区西寺尾一丁目1-1' ],
    [ 'ザ・パークハウス横浜大口B棟', 'ｻﾞﾊﾟ-ｸﾊｳｽ横浜大口b', '神奈川県横浜市神奈川区西寺尾一丁目1-1' ],
    [ 'ザ・パークハウス横浜大口C棟', 'ｻﾞﾊﾟ-ｸﾊｳｽ横浜大口c', '神奈川県横浜市神奈川区西寺尾一丁目1-1' ],
    [ 'タワービレッジ鷺沼　304', 'ﾀﾜ-ﾋﾞﾚﾂｼﾞ鷺沼304', '神奈川県川崎市宮前区東有馬二丁目38-1' ],
    [ 'タワービレッジ鷺沼　310', 'ﾀﾜ-ﾋﾞﾚﾂｼﾞ鷺沼310', '神奈川県川崎市宮前区東有馬二丁目38-1' ],
    [ 'ファイブアイランドⅠ', 'ﾌｱｲﾌﾞｱｲﾗﾝﾄﾞⅰ', '三重県伊勢市竹ケ鼻町160-1' ],
    [ 'ファイブアイランドⅢ', 'ﾌｱｲﾌﾞｱｲﾗﾝﾄﾞⅲ', '三重県伊勢市竹ケ鼻町160-1' ],
    [ 'ファイブアイランドⅫ', 'ﾌｱｲﾌﾞｱｲﾗﾝﾄﾞⅻ', '三重県伊勢市竹ケ鼻町160-1' ],
    [ 'パイン新宿', 'ﾊﾟｲﾝ新宿', '東京都新宿区北新宿一丁目20-10' ],
    [ 'パイン新宿③❹⑸⒍', 'ﾊﾟｲﾝ新宿③❹⑸⒍', '東京都新宿区北新宿一丁目20-10' ],
    [ 'マイスタイル町屋壱番館', 'ﾏｲｽﾀｲﾙ町屋1', '東京都荒川区荒川四丁目3-3' ],
    [ 'マイスタイル町屋弐番館', 'ﾏｲｽﾀｲﾙ町屋2', '東京都荒川区荒川四丁目3-3' ]
  ])
})
